/**
 * Количество генераций моковых данных.
 */
const PHOTO_DATA_COUNT = 25;

/**
 * Массив имен комментаторов.
 */
const MOCK_COMMENTATORS = [
  'Николай',
  'Алиса',
  'Максим',
  'Виктория',
  'Иван',
  'Анастасия',
  'Алексей',
  'Екатерина',
  'Дмитрий',
  'Ольга',
  'Артем',
  'Елена',
  'Сергей',
  'Мария',
  'Андрей',
  'Юлия',
  'Владимир',
  'Анна',
  'Антон',
  'Ксения',
  'Игорь',
  'Александра',
  'Павел',
  'Елизавета',
  'Глеб'
];

/**
 * Массив комментариев под фото.
 */
const MOCK_COMMENTS = [
  'Прекрасный пейзаж!',
  'Замечательный портрет!',
  'Великолепная композиция.',
  'Фотография полна эмоций.',
  'Красивые цвета!',
  'Интересный ракурс.',
  'Фантастический свет.',
  'Момент запечатлен идеально.',
  'Такая милая улыбка!',
  'Потрясающая игра света и тени.',
  'Креативное использование глубины резкости.',
  'Эффектное использование цветового контраста.',
  'Фотография передает атмосферу момента.',
  'Отличный фокус на главном объекте.',
  'Хорошая работа с композицией.',
  'Прекрасное использование линий и форм.',
  'Удачный выбор ракурса.',
  'Завораживающая игра света и отражений.',
  'Эмоциональная история, рассказанная на фото.',
  'Интересный выбор фокусировки.',
  'Такое мягкое и нежное освещение.',
  'Отличный контраст между цветами.',
  'Воздушная и легкая композиция.',
  'Красивый пастельный тон.',
  'Фотография полна жизни и движения.'
];

/**
 * Массив описаний к фотографии.
 */
const MOCK_DESCRIPTIONS = [
  'Наслаждаясь моментом...',
  'Потерян в красоте природы.',
  'Очарован архитектурой этого города.',
  'Путешествие - источник вдохновения.',
  'Магия закатного неба.',
  'Ничто не сравнится с моментами, проведенными на пляже.',
  'Волшебный лес, полный загадок.',
  'Испытываю адреналин на высоте!',
  'Просто счастлив здесь и сейчас.',
  'Цветочное настроение.',
  'Идеальное сочетание цветов.',
  'Красота в деталях.',
  'Вкусные моменты жизни.',
  'Провожу время с лучшими друзьями.',
  'Самые яркие воспоминания.',
  'Забавные моменты с семьей.',
  'Ощущение свободы.',
  'Встречая рассвет с улыбкой.',
  'Мечта сбывается!',
  'Радость в каждом кадре.',
  'Уловили момент счастья.',
  'Магия зимнего дня.',
  'Игра света и теней.',
  'Расслабление и покой.',
  'Танцуя под открытым небом.'
];

export { PHOTO_DATA_COUNT, MOCK_COMMENTATORS, MOCK_COMMENTS, MOCK_DESCRIPTIONS };
